# Задание 1
# a = int(input("Введите пятизначное число: "))
#
# a1 = a//10000
# a2 = a//1000%10
# a3 = a//100%10
# a4 = a//10%10
# a5 = a%10
# print("Произведение цифр числа:", a1*a2*a3*a4*a5)
# print("Среднее арифметическое:", (a1+a2+a3+a4+a5)/5)



# Задание 2
# a = int(input("Введите целое число: "))
# if a % 2 == 0:
#     print("Число", a, "четное")
# else:
#     print("Число", a, "нечетное")




# Задание 3
# print("Выберите операцию: \n"
#       '1 - "r" - применяет унарный минус к операнду\n'
#       '2 - "+" - сложение\n'
#       '3 - "-" - вычитание\n'
#       '4 - "/" - деление\n'
#       '5 - "*" - умножение\n'
#       '6 - "%" - деление по модулю (остаток от деления)\n'
#       '7 - "<" - минимальное из двух чисел\n'
#       '8 - ">" - максимальное из двух чисел\n')
# a = int(input("Введите цифру: "))
#
# if a == 1:
#     b = int(input("Введите число: "))
#     print(b*-1)
# elif 8 >= a > 1:
#     b = int(input("Введите первое число: "))
#     c = int(input("Введите второе число: "))
#     if a == 2:
#             print(b + c)
#     elif a == 3:
#             print(b - c)
#     elif a == 4:
#         if c == 0:
#             print("На ноль делить нельзя")
#         else:
#             print(round(b / c, 2))
#     elif a == 5:
#             print(b * c)
#     elif a == 6:
#         if c == 0:
#             print("На ноль делить нельзя")
#         else:
#             print(b % c)
#     elif a == 7:
#         if b >= c:
#             print(c)
#         else:
#             print(b)
#     elif a == 8:
#         if b >= c:
#             print(b)
#         else:
#             print(c)
# else:
#     print("Вы ввели не правильное число")




# Задание 4 (не обязательное)
# a = int(input("Введите число от 1 до 99: "))
# if 1<=a<=99:
#     if 11<=a<=14 or 5<=a%10<=9 or a%10==0:
#         print(a, "копеек")
#     elif 2<=a%10<=4:
#         print(a, "копейки")
#     elif a%10==1:
#         print(a, "копейка")
# else:
#     print("не правильное число")


